xzcvczx/mla-legacy/TCPIP WiFi Demo App/Alternative Configurations/HardwareProfile PIC32 Starter Kit ZG2100 SPI 1.h
//	// ENC424J600/624J600 Fast 100Mbps Ethernet PICtail Plus defines
//	#define ENC100_INTERFACE_MODE			0		// Uncomment this line to use the ENC424J600/624J600 Ethernet controller (SPI mode) or comment it out to use some other network controller
//
//	// ENC100_MDIX, ENC100_POR, and ENC100_INT are all optional.  Simply leave 
//	// them commented out if you don't have such a hardware feature on your 
//	// hardware.
//	#define ENC100_MDIX_TRIS				(TRISB4)
//	#define ENC100_MDIX_IO					(LATB4)
////	#define ENC100_POR_TRIS					(TRISB5)
////	#define ENC100_POR_IO					(LATB5)
////	#define ENC100_INT_TRIS					(TRISB2)
////	#define ENC100_INT_IO					(RB2)
//
//	// ENC424J600/624J600 SPI pinout
//	#define ENC100_CS_TRIS					(TRISB3)
//	#define ENC100_CS_IO					(LATB3)
//	#define ENC100_SO_WR_B0SEL_EN_TRIS		(TRISC4)	// NOTE: SO is ENC624J600 Serial Out, which needs to connect to the PIC SDI pin for SPI mode
//	#define ENC100_SO_WR_B0SEL_EN_IO		(RC4)
//	#define ENC100_SI_RD_RW_TRIS			(TRISC5)	// NOTE: SI is ENC624J600 Serial In, which needs to connect to the PIC SDO pin for SPI mode
//	#define ENC100_SI_RD_RW_IO				(LATC5)
//	#define ENC100_SCK_AL_TRIS				(TRISC3)
//	#define ENC100_SCK_AL_IO				(RC3)		// NOTE: This must be the PORT, not the LATch like it is for the PSP interface.
//
//	// ENC424J600/624J600 SPI SFR register selection (controls which SPI 
//	// peripheral to use on PICs with multiple SPI peripherals).
////	#define ENC100_ISR_ENABLE		(INT2IE)
////	#define ENC100_ISR_FLAG			(INT2IF)
////	#define ENC100_ISR_POLARITY		(INTEDG2)
////	#define ENC100_ISR_PRIORITY		(INT2IP)
//	#define ENC100_SPI_ENABLE		(ENC100_SPISTATbits.SPIEN)
//	#define ENC100_SPI_IF			(SSP1IF)
//	#define ENC100_SSPBUF			(SSP1BUF)
//	#define ENC100_SPISTAT			(SSP1STAT)
//	#define ENC100_SPISTATbits		(SSP1STATbits)
//	#define ENC100_SPICON1			(SSP1CON1)
//	#define ENC100_SPICON1bits		(SSP1CON1bits)
//	#define ENC100_SPICON2			(SSP1CON2)

//	// ENC28J60 I/O pins
//	#define ENC_RST_TRIS		(TRISB5)
//	#define ENC_RST_IO			(LATB5)
//	#define ENC_CS_TRIS			(TRISB3)	// Uncomment this line to use the ENC28J60 Ethernet controller or comment it out to use some other network controller
//	#define ENC_CS_IO			(LATB3)
//	#define ENC_SCK_TRIS		(TRISC3)
//	#define ENC_SDI_TRIS		(TRISC4)
//	#define ENC_SDO_TRIS		(TRISC5)
//	#define ENC_SPI_IF			(SSP1IF)
//	#define ENC_SSPBUF			(SSP1BUF)
//	#define ENC_SPISTAT			(SSP1STAT)
//	#define ENC_SPISTATbits		(SSP1STATbits)
//	#define ENC_SPICON1			(SSP1CON1)
//	#define ENC_SPICON1bits		(SSP1CON1bits)
//	#define ENC_SPICON2			(SSP1CON2)

//	// 25LC256 I/O pins
//	#define EEPROM_CS_TRIS		(TRISA3)
//	#define EEPROM_CS_IO		(LATA3)
//	#define EEPROM_SCK_TRIS		(TRISC3)
//	#define EEPROM_SDI_TRIS		(TRISC4)
//	#define EEPROM_SDO_TRIS		(TRISC5)
//	#define EEPROM_SPI_IF		(SSP1IF)
//	#define EEPROM_SSPBUF		(SSP1BUF)
//	#define EEPROM_SPICON1		(SSP1CON1)
//	#define EEPROM_SPICON1bits	(SSP1CON1bits)
//	#define EEPROM_SPICON2		(SSP1CON2)
//	#define EEPROM_SPISTAT		(SSP1STAT)
//	#define EEPROM_SPISTATbits	(SSP1STATbits)

	// LCD I/O pins
	// TODO: Need to add support for LCD behind MCP23S17 I/O expander.  This 
	// requires code that isn't in the TCP/IP stack, not just a hardware 
	// profile change.

	// Register name fix up for certain processors
	#define SPBRGH				SPBRGH1
	#define TXSTAbits			TXSTA1bits
	#define RCSTAbits			RCSTA1bits
	#define BAUDCONbits			BAUDCON1bits
	#define GO					GODONE
	#if defined(__18F87J50) || defined(_18F87J50) || defined(__18F87J11) || defined(_18F87J11)
		#define ADCON2		ADCON1
	#endif

#elif defined(HPC_EXPLORER) && !defined(HI_TECH_C)
// PICDEM HPC Explorer + Fast 100Mbps Ethernet PICtail Plus or Ethernet PICtail
	// I/O pins
	#define LED0_TRIS			(TRISDbits.TRISD0)
	#define LED0_IO				(LATDbits.LATD0)
	#define LED1_TRIS			(TRISDbits.TRISD1)
	#define LED1_IO				(LATDbits.LATD1)
	#define LED2_TRIS			(TRISDbits.TRISD2)
	#define LED2_IO				(LATDbits.LATD2)
	#define LED3_TRIS			(TRISDbits.TRISD3)
	#define LED3_IO				(LATDbits.LATD3)
	#define LED4_TRIS			(TRISDbits.TRISD4)
	#define LED4_IO				(LATDbits.LATD4)
	#define LED5_TRIS			(TRISDbits.TRISD5)
	#define LED5_IO				(LATDbits.LATD5)
	#define LED6_TRIS			(TRISDbits.TRISD6)
	#define LED6_IO				(LATDbits.LATD6)
	#define LED7_TRIS			(TRISDbits.TRISD7)
	#define LED7_IO				(LATDbits.LATD7)
	#define LED_GET()			(LATD)
	#define LED_PUT(a)			(LATD = (a))


	#define BUTTON0_TRIS		(TRISBbits.TRISB0)
	#define	BUTTON0_IO			(PORTBbits.RB0)
	#define BUTTON1_TRIS		(TRISBbits.TRISB0)	// No Button1 on this board, remap to Button0
	#define	BUTTON1_IO			(PORTBbits.RB0)
	#define BUTTON2_TRIS		(TRISBbits.TRISB0)	// No Button2 on this board, remap to Button0
	#define	BUTTON2_IO			(PORTBbits.RB0)
	#define BUTTON3_TRIS		(TRISBbits.TRISB0)	// No Button3 on this board, remap to Button0
	#define	BUTTON3_IO			(PORTBbits.RB0)

//	// ENC424J600/624J600 Fast 100Mbps Ethernet PICtail Plus defines
//	#define ENC100_INTERFACE_MODE			0		// Uncomment this line to use the ENC424J600/624J600 Ethernet controller (SPI mode) or comment it out to use some other network controller
//
//	// ENC424J600/624J600 Fast 100Mbps Ethernet PICtail Plus I/O pins
//	#define ENC100_MDIX_TRIS				(TRISBbits.TRISB4)
//	#define ENC100_MDIX_IO					(LATBbits.LATB4)
//	#define ENC100_POR_TRIS					(TRISBbits.TRISB5)
//	#define ENC100_POR_IO					(LATBbits.LATB5)
////	#define ENC100_INT_TRIS					(TRISBbits.TRISB2)
////	#define ENC100_INT_IO					(PORTBbits.RB2)
//
//	// ENC424J600/624J600 SPI pinout
//	#define ENC100_CS_TRIS					(TRISBbits.TRISB3)
//	#define ENC100_CS_IO					(LATBbits.LATB3)
//	#define ENC100_SO_WR_B0SEL_EN_TRIS		(TRISCbits.TRISC4)	// NOTE: SO is ENC624J600 Serial Out, which needs to connect to the PIC SDI pin for SPI mode
//	#define ENC100_SO_WR_B0SEL_EN_IO		(PORTCbits.RC4)
//	#define ENC100_SI_RD_RW_TRIS			(TRISCbits.TRISC5)	// NOTE: SI is ENC624J600 Serial In, which needs to connect to the PIC SDO pin for SPI mode
//	#define ENC100_SI_RD_RW_IO				(LATCbits.LATC5)
//	#define ENC100_SCK_AL_TRIS				(TRISCbits.TRISC3)
//	#define ENC100_SCK_AL_IO				(PORTCbits.RC3)		// NOTE: This must be the PORT, not the LATch like it is for the PSP interface.
//
//	// ENC424J600/624J600 SPI SFR register selection (controls which SPI 
//	// peripheral to use on PICs with multiple SPI peripherals).
////	#define ENC100_ISR_ENABLE		(INTCON3bits.INT2IE)
////	#define ENC100_ISR_FLAG			(INTCON3bits.INT2IF)
////	#define ENC100_ISR_POLARITY		(INTCON2bits.INTEDG2)
////	#define ENC100_ISR_PRIORITY		(INTCON3bits.INT2IP)
//	#define ENC100_SPI_ENABLE		(ENC100_SPISTATbits.SPIEN)
//	#define ENC100_SPI_IF			(PIR1bits.SSPIF)
//	#define ENC100_SSPBUF			(SSP1BUF)
//	#define ENC100_SPISTAT			(SSP1STAT)
//	#define ENC100_SPISTATbits		(SSP1STATbits)
//	#define ENC100_SPICON1			(SSP1CON1)
//	#define ENC100_SPICON1bits		(SSP1CON1bits)
//	#define ENC100_SPICON2			(SSP1CON2)

//	// ENC28J60 I/O pins
//	#define ENC_RST_TRIS		(TRISBbits.TRISB5)
//	#define ENC_RST_IO			(LATBbits.LATB5)
//	#define ENC_CS_TRIS			(TRISBbits.TRISB3)	// Uncomment this line to use the ENC28J60 Ethernet controller or comment it out to use some other network controller
//	#define ENC_CS_IO			(LATBbits.LATB3)
//	#define ENC_SCK_TRIS		(TRISCbits.TRISC3)
//	#define ENC_SDI_TRIS		(TRISCbits.TRISC4)
//	#define ENC_SDO_TRIS		(TRISCbits.TRISC5)
//	#define ENC_SPI_IF			(PIR1bits.SSPIF)
//	#define ENC_SSPBUF			(SSP1BUF)
//	#define ENC_SPISTAT			(SSP1STAT)
//	#define ENC_SPISTATbits		(SSP1STATbits)
//	#define ENC_SPICON1			(SSP1CON1)
//	#define ENC_SPICON1bits		(SSP1CON1bits)
//	#define ENC_SPICON2			(SSP1CON2)

//	// 25LC256 I/O pins
//	#define EEPROM_CS_TRIS		(TRISBbits.TRISB4)
//	#define EEPROM_CS_IO		(LATBbits.LATB4)
//	#define EEPROM_SCK_TRIS		(TRISCbits.TRISC3)
//	#define EEPROM_SDI_TRIS		(TRISCbits.TRISC4)
//	#define EEPROM_SDO_TRIS		(TRISCbits.TRISC5)
//	#define EEPROM_SPI_IF		(PIR1bits.SSPIF)
//	#define EEPROM_SSPBUF		(SSP1BUF)
//	#define EEPROM_SPICON1		(SSP1CON1)
//	#define EEPROM_SPICON1bits	(SSP1CON1bits)
//	#define EEPROM_SPICON2		(SSP1CON2)
//	#define EEPROM_SPISTAT		(SSP1STAT)
//	#define EEPROM_SPISTATbits	(SSP1STATbits)

	// Register name fix up for certain processors
	#define SPBRGH				SPBRGH1
	#if defined(__18F87J50) || defined(_18F87J50) || defined(__18F87J11) || defined(_18F87J11)
		#define ADCON2		ADCON1
	#endif
	
